doc/xml/OTA_HotelRateAmountNotifRQ.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header
            xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security soap:mustUnderstand="1"
                       xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <wsse:UsernameToken>
                <wsse:Username>username</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body
            xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <OTA_HotelRateAmountNotifRQ
                xmlns="http://www.opentravel.org/OTA/2003/05" Version="1.0"
                TimeStamp="2019-05-24T11:34:42+0700"
                EchoToken="41f125b9-b81a-47de-e529-59aa73938e38">
            <RateAmountMessages HotelCode="{HOTEL_CODE}">
                <RateAmountMessage>
                    <StatusApplicationControl
                            InvTypeCode="{ROOM_CODE}" RatePlanCode="{RATE_CODE}"
                            Start="2019-05-24" End="2020-05-22" />
                    <Rates>
                        <Rate>
                            <BaseByGuestAmts>
                                <BaseByGuestAmt AgeQualifyingCode="10"
                                                AmountAfterTax="1000" CurrencyCode="THB" NumberOfGuests="1" />
                                <BaseByGuestAmt AgeQualifyingCode="10"
                                                AmountAfterTax="1000" CurrencyCode="THB" NumberOfGuests="2" />
                            </BaseByGuestAmts>
                        </Rate>
                    </Rates>
                </RateAmountMessage>
                <RateAmountMessage>
                    <StatusApplicationControl
                            InvTypeCode="{ROOM_CODE}" RatePlanCode="{RATE_CODE}"
                            Start="2020-05-23" End="2020-05-23" />
                    <Rates>
                        <Rate>
                            <BaseByGuestAmts>
                                <BaseByGuestAmt AgeQualifyingCode="10"
                                                AmountAfterTax="1000" CurrencyCode="THB" NumberOfGuests="1" />
                                <BaseByGuestAmt AgeQualifyingCode="10"
                                                AmountAfterTax="1000" CurrencyCode="THB" NumberOfGuests="2" />
                            </BaseByGuestAmts>
                        </Rate>
                    </Rates>
                </RateAmountMessage>
            </RateAmountMessages>
        </OTA_HotelRateAmountNotifRQ>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>